{
  "nav": {
    "home": "Inicio",
    "about": "Acerca de",
    "projects": "Proyectos",
    "skills": "Habilidades",
    "contact": "Contacto"
  },
  "header": {
    "title": "{name} Desarrollador de Software",
    "greeting": "Hola, soy",
    "name": "Carlos Veizaga",
    "role": "Desarrollador Full Stack",
    "roles": [
      "Desarrollador Full Stack",
      "Entusiasta de UI/UX",
      "Solucionador de Problemas",
      "Explorador Tecnológico"
    ],
    "contact": "Contacta me"
  },
  "info": {
    "about": "Acerca de Mi",
    "introduction": "Soy {name}, un <span class='font-bold text-gray-900 dark:text-white'>Desarrollador Full-Stack</span> con más de 7 años creando experiencias digitales. No solo escribo código; construyo <span class='font-bold text-gray-900 dark:text-white'>motores escalables de alto rendimiento</span> usando Laravel, Vue y Node.js. Desde la arquitectura de backends complejos hasta el pulido de frontends perfectos, uno la brecha entre la <span class='font-bold text-gray-900 dark:text-white'>complejidad técnica y la simplicidad del usuario</span>. ¿Mi misión? Convertir ideas ambiciosas en software confiable y listo para el mercado.",
    "description_1": "Soy un Desarrollador Full-Stack con más de 7 años de experiencia creando experiencias digitales. No solo escribo código; construyo motores escalables de alto rendimiento usando Laravel, Vue y Node.js.",
    "description_2": "Desde la arquitectura de backends complejos hasta el pulido de frontends perfectos, uno la brecha entre la complejidad técnica y la simplicidad del usuario. Mi misión es convertir ideas ambiciosas en software confiable y listo para el mercado.",
    "download": "Descargar CV",
    "view_projects": "Ver Proyectos",
    "philosophy": "Mi Filosofía de Desarrollo",
    "principles": {
      "clean_code": {
        "title": "Código Limpio y Arquitectura",
        "description": "Priorizo la mantenibilidad, escalabilidad y principios SOLID para sistemas robustos."
      },
      "user_centric": {
        "title": "Diseño Centrado en el Usuario",
        "description": "Cada píxel e interacción está diseñado pensando en el usuario final para experiencias intuitivas."
      },
      "scalable_performance": {
        "title": "Rendimiento Escalable",
        "description": "Construyendo sistemas de alto rendimiento que crecen sin comprometer la velocidad."
      },
      "continuous_evolution": {
        "title": "Evolución Continua",
        "description": "Comprometido con el aprendizaje continuo para ofrecer soluciones preparadas para el futuro."
      }
    }
  },
  "projects": {
    "title": "Presentación del proyecto",
    "explore": "Explorar Projecto",
    "live": "Demo en vivo",
    "view": "Ver Código",
    "featured": "Destacado",
    "more_projects": "Descubra más proyectos",
    "show_less": "Mostrar menos",
    "list": {
      "educertify": {
        "title": "EduCertify",
        "short_description": "Educertify es una plataforma para crear, personalizar y enviar certificados digitales con facilidad.",
        "full_description": "Educertify es una plataforma de generación y distribución de certificados diseñada para una fácil personalización. Los usuarios pueden personalizar los certificados cambiando fuentes, colores y agregando firmas. La plataforma también permite cargar certificados previamente firmados o firmarlos digitalmente directamente. Una vez creados, los certificados se pueden enviar a los destinatarios por correo electrónico, lo que hace que el proceso de distribución sea eficiente. Educertify permite a los usuarios generar certificados profesionales con facilidad y flexibilidad, ofreciendo tanto personalización como entrega automatizada.",
        "features": {
          "template": "Plantillas de certificados personalizables",
          "signature": "Opciones de firma digital y manual",
          "customization": "Personalización de fuentes y colores",
          "management": "Carga y gestión de certificados",
          "delivery": "Entrega automática de certificados por correo electrónico",
          "authentication": "Autenticación de usuarios y gestión de perfiles",
          "dashboard": "Panel de administración para seguimiento y análisis de certificados"
        }
      },
      "animehero": {
        "title": "Anime Hero Challengue",
        "short_description": "Anime Hero Challenge es un divertido y atractivo juego de adivinanzas de personajes con personajes de Dragon Ball y Pokémon.",
        "full_description": "Anime Hero Challengue es un juego interactivo que desafía a los usuarios a identificar personajes de Dragon Ball o Pokémon. Los jugadores eligen entre las dos series y se muestra la silueta de un personaje. Los usuarios deben adivinar el personaje entre varias opciones y ganan puntos por las respuestas correctas. Si responden incorrectamente, la puntuación se reinicia y se les anima a intentarlo de nuevo. GuessMaster combina diversión y competencia, brindando entretenimiento sin fin para los fanáticos de estas franquicias icónicas.",
        "features": {
          "selection": "Selección de personajes de anime de Dragon Ball y Pokémon",
          "silhouette": "Juego de adivinanzas de siluetas de personajes",
          "multiple": "Opciones de selección múltiple para identificar personajes",
          "scoring": "Sistema de puntuación basado en aciertos",
          "reset": "Reinicio de puntuación en caso de respuestas incorrectas",
          "series": "Opción para elegir entre diferentes series de anime",
          "api": "Integración de API para información dinámica de personajes",
          "progress": "Seguimiento del progreso de los jugadores",
          "responsive": "Diseño responsivo para una experiencia fluida en todos los dispositivos",
          "expansion": "Expansión futura con series de anime adicionales"
        }
      },
      "elfec": {
        "title": "ELFEC",
        "short_description": "ELFEC es un CMS para la gestión de servicios y la atención al cliente de la empresa de electricidad de Cochabamba.",
        "full_description": "ELFEC.bo es una plataforma diseñada para la gestión integral de servicios eléctricos, permitiendo a la Empresa de Electricidad de Cochabamba (ELFEC) ofrecer un servicio eficiente a sus clientes. La plataforma permite la gestión de cuentas de usuario, consulta de facturas, y reportes de fallas, facilitando la comunicación entre la empresa y sus usuarios. Además, el CMS incluye funcionalidades para la generación de informes y estadísticas sobre el consumo y la satisfacción del cliente, mejorando así la calidad del servicio. elfec.bo está orientado a mejorar la experiencia del cliente y optimizar la operación interna de la empresa.",
        "features": {
          "user_management": "Gestión de cuentas de usuario y perfiles",
          "billing": "Consulta y gestión de facturas",
          "reporting": "Reportes de fallas y estadísticas de consumo",
          "notifications": "Notificaciones automáticas de servicio y actualizaciones",
          "analytics": "Panel de administración con análisis de datos de clientes y servicios",
          "support": "Soporte al cliente y gestión de tickets",
          "mobile_access": "Acceso móvil para una gestión eficiente en cualquier lugar"
        }
      }
    }
  },
  "modal": {
    "key_features": "Características Principales",
    "technologies_used": "Tecnologías Utilizadas",
    "view_demo": "Ver Demo en Vivo",
    "view_code": "Ver en GitHub"
  },
  "skills": {
    "title": "Habilidades y Experiencia",
    "sphere": {
      "title": "Esfera de Habilidades 3D",
      "proficiency": "Competencia",
      "detail": "Pasa el cursor sobre la esfera para explorar las habilidades"
    },
    "categories": {
      "title": "Categorías de Habilidades",
      "proficiency": "Nivel de Competencia"
    },
    "technologies": "Herramientas y tecnologías"
  },
  "contact": {
    "title": "Ponte en Contacto",
    "title2": "Conéctate Conmigo",
    "formTitle": "Enviar un Mensaje",
    "terms": "Acepto los términos y la política de privacidad",
    "sending": "Enviando",
    "send": "Enviar Mensaje",
    "name": "Tu Nombre",
    "email": "Tu Correo Electrónico",
    "message": "¿En qué puedo ayudarte?",
    "form": {
      "name": {
        "label": "Nombre",
        "placeholder": "Tu nombre completo"
      },
      "email": {
        "label": "Correo electrónico",
        "placeholder": "tu.correo@ejemplo.com"
      },
      "subject": {
        "label": "Asunto",
        "placeholder": "¿Sobre qué trata?"
      },
      "message": {
        "label": "Mensaje",
        "placeholder": "Tu mensaje aquí..."
      }
    }
  },
  "message": {
    "hello": "¡Hola Mundo!",
    "welcome": "Bienvenido a {app}",
    "language": "Idioma"
  }
}
